Repository: NiryoRobotics/pyniryo
Catalog: docs/locale/*/LC_MESSAGES/source/setup/installation.po
Languages: fr

source: The library uses `Python <https://www.python.org/>`_, which must be installed and available in your working environment.
fr: Cette bibliothèque utilise `Python <https://www.python.org/>`_, qui doit être installé et disponible dans votre environnement de travail. ::

source: The version should be **equal or above**:
fr: La version doit être **égale ou supérieure** :

source: 2.7 if you are using Python 2
fr: 2.7 si vous utilisez Python 2

source: 3.6 if you are using Python 3
fr: 3.6 si vous utilisez Python 3

source: To check your Python version, use the command ``python --version`` if you are using Python 2 and ``python3 --version`` if you are using Python3.
fr: Pour vérifier la version de votre Python, utilisez la commande ``python --version`` si vous utilisez Python 2 et ``python3 --version`` si vous utilisez Python 3.

source: The below sections explain how to install the library with **pip**, the package installer for Python.
fr: Les sections ci-dessous expliquent comment installer la bibliothèque avec **pip**, l'installateur de package de Python.

source: If you have both Python 2 & Python 3 installed on your computer, the command ``pip`` will install packages in Python 2 version. You should use ``pip3`` instead in order to target Python 3.
fr: Si vous avez Python 2 & Python 3 installés sur votre ordinateur, la commande ``pip`` installera les packages sur la version Python 2. Utilisez ``pip3`` à la place afin de les installer sur Python 3.

source: Installation with pip
fr: Installation avec pip

source: You need to install Numpy package beforehand: ::
fr: Avant toute chose, vous avez besoin d'installer le package Numpy : ::

source: To install Ned's Python package via ``pip``, simply execute::
fr: Afin d'installer le package Python pour le Ned via ``pip``, exécutez simplement : ::

source: You can find more information about the PyPi package `here <https://pypi.org/project/pyniryo/>`_.
fr: Vous pouvez retrouver davantage d'informations à propos du package PyPi `ici <https://pypi.org/project/pyniryo/>`_.

source: If you also want to use Vision functions to do your own Image Processing pipeline install OpenCV via the command: ::
fr: Si vous souhaitez également utiliser les fonctions de vision avec de créer vos propres pipelines de traitement d'images, installez OpenCV avec la commande : ::

source: Uninstall
fr: Désinstaller

source: To uninstall the library use::
fr: Afin de désinstaller la bibliothèque, utilisez : ::
