Repository: NiryoRobotics/pyniryo
Catalog: docs/locale/*/LC_MESSAGES/source/setup/ip_address.po
Languages: fr

source: Find your Robot's IP address
fr: Trouver l'adresse IP de votre robot

source: In order to use your robot through TCP connection, you will firstly need to connect to it, which implies that you know its IP address.
fr: Afin d'utiliser votre robot par le biais d'une connexion TCP, vous aurez premièrement besoin de vous connecter à celui-ci, ce qui implique que vous connaissiez son adresse IP.

source: The next sections explain how to find your robot IP according to your configuration:
fr: Les sections suivantes expliquent comment trouver votre adresse IP en fonction de votre configuration :

source: Hotspot mode
fr: Mode Hotspot

source: If you are directly connected to your robot through its wifi, the IP Address you will need to use is ``10.10.10.10``.
fr: Si vous connecté directement à votre robot depuis son wifi, l'adresse IP que vous devrez utiliser est ``10.10.10.10``.

source: Simulation or directly on the robot
fr: Simulation ou directement sur le robot

source: In this situation, the robot is running on the same computer as the client, the IP address will be the localhost address ``127.0.0.1``.
fr: Dans cette situation, le robot fonctionne sur le même ordinateur que le client, l'adresse IP sera donc l'adresse locale (localhost) ``127.0.0.1``.

source: Direct ethernet connection
fr: Connexion ethernet directe

source: If you are directly connected to your robot with an ethernet cable, the static IP of your robot will be ``169.254.200.200``.
fr: Si vous êtes directement connecté à votre robot avec un câble ethernet, l'IP fixe de votre robot sera ``169.254.200.200``.

source: The reader should note that he may need to change his wired settings to allow the connection. See how `to connect to Ned via Ethernet on Ubuntu <https://niryo.com/docs/niryo-one/developer-tutorials/connect-to-niryo-one-via-ethernet-on-ubuntu/>`_.
fr: Notez qu'il peut être nécessaire de changer vos paramètres de connexion câblée afin de permet la connexion. Découvrez comment `connecter Ned à Ubuntu en Ethernet <https://niryo.com/docs/niryo-one/developer-tutorials/connect-to-niryo-one-via-ethernet-on-ubuntu/>`_.

source: Computer and robot connected on the same router
fr: Ordinateur et robot connectés au même routeur

source: You will need to find the robot's address using ``nmap``, or you can also use search button of Niryo Studio to see which robots are available.
fr: Vous aurez besoin de trouver l'adresse du robot en utilisant ``nmap``. Vous pouvez aussi utiliser le bouton de recherche sur Niryo Studio pour voir les robots disponibles.

source: You can also :ref:`source/setup/ip_address:Make IP permanent` so that you will not have to search for it next time
fr: Vous pouvez également :ref:`rendre l'IP permanente <source/setup/ip_address:Make IP permanent>` afin de ne plus avoir à la rechercher les fois suivantes.

source: Make IP permanent
fr: Rendre l'IP permanente

source: Step 1
fr: Étape 1

source: Firstly, you need to be connected to your robot via SSH.
fr: Tout d'abord, connectez vous à votre robot en SSH.

source: On Ubuntu, use the command line::
fr: Sur Ubuntu, utilisez la ligne de commande : ::

source: The password is ``robotics``.
fr: Le mot de passe est ``robotics``.

source: On Windows, you can use `Putty <https://www.putty.org/>`_. Robot username is ``niryo`` and password is ``robotics``.
fr: Sur Windows, vous pouvez utiliser `Putty <https://www.putty.org/>`_. Le nom d'utilisateur est ``niryo`` et le mot de passe est ``robotics``.

source: Step 2
fr: Étape 2

source: Find your proxy key: ::
fr: Trouvez votre clé proxy :

source: Your proxy key is written on the first line and should look something like ``eth0``.
fr: Votre clé proxy est indiquée sur la première ligne et vous devriez voir quelque chose comme ``eth0``.

source: Step 3
fr: Étape 3

source: Select arbitrarily a number between 50 & 255. It will be your IP address' last number.
fr: Choisissez arbitrairement un nombre entre 50 et 255. Ce sera le dernier nombre de votre adresse IP.

source: Then, edit the file ``/etc/network/interfaces``::
fr: Ensuite, éditez le document ``/etc/network/interfaces``::

source: And add to its end::
fr: Et ajoutez à la fin : ::

source: From its next reboot, the robot will appear under the IP ``192.168.1.<your_ip_address_last_number>``.
fr: À partir de son prochain redémarrage, le robot apparaître sous l'adresse IP ``192.168.1.<your_ip_address_last_number>``.
