Repository: NiryoRobotics/pyniryo
Catalog: docs/locale/*/LC_MESSAGES/source/vision/image_processing_api.po
Languages: fr

source: Functions documentation
fr: Documentation des fonctions

source: This file presents the different functions and :ref:`source/vision/image_processing_api:Enums Image Processing` available for image processing.
fr: Ce document présente les différentes fonctions et :ref:`source/vision/image_processing_api:Enums Image Processing` disponibles pour le traitement d'images.

source: These functions are divided in subsections:
fr: Ces fonctions sont divisées en sous-sections :

source: :ref:`source/vision/image_processing_api:Pure Image Processing` are used to deal with the thresholding, contours detection, ..
fr: Les fonctions contenues dans :ref:`source/vision/image_processing_api:Pure Image Processing` permettent d'utiliser le seuillage, la détection de contours,...

source: :ref:`source/vision/image_processing_api:Workspaces wise` section contains functions to extract workspace and deal with the relative position in the workspace
fr: La section :ref:`source/vision/image_processing_api:Workspaces wise` contient les fonctions permettant d'extraire le workspace et de gérer les position relatives dans le workspace

source: The section :ref:`source/vision/image_processing_api:Show` allows to display images
fr: La section :ref:`source/vision/image_processing_api:Show` permet d'afficher des images

source: :ref:`source/vision/image_processing_api:Image Editing` contains lot of function which can compress images, add text to image, ...
fr: :ref:`source/vision/image_processing_api:Image Editing` contient un grand nombre de fonctions qui permettent de compresser les images, y ajouter du texte, ...

source: Pure image processing
fr: Pur traitement d'images

source: Take BGR image (OpenCV imread result) and return thresholded image according to values on HSV (Hue, Saturation, Value) Pixel will worth 1 if a pixel has a value between min_v and max_v for all channels
fr: Prend une image RVB (résultat OpenCV imread) et retourne une image seuillée en fonction des valeurs de HSV (Teinte, Saturation, Valeur). Le pixel vaudra 1 s'il a une valeur entre min_v et max_v pour tous les canaux.

source: Parameters
fr: Paramètres

source: image BGR if rgb_space = False
fr: Image BVR si rgb_space = faux

source: list corresponding to [min_value_H,min_value_S,min_value_V]
fr: liste correspondant à [min_value_H,min_value_S,min_value_V]

source: list corresponding to [max_value_H,max_value_S,max_value_V]
fr: liste correspondant à [max_value_H,max_value_S,max_value_V]

source: True if you want to use S channel as S' = S x V else classic
fr: Vrai si vous voulez utiliser le canal S comme S' = S x V, autrement classique

source: Useful for Red color cause it is at both extremum
fr: Utile pour la couleur rouge car elle est aux deux extrêmes

source: Returns
fr: Retourne

source: threshold image
fr: image seuillée

source: Return type
fr: Type de variable de retour

source: Return masked image to see the effect of color threshold
fr: Retourne une image masquée afin de voir l'effet du seuillage des couleurs

source: OpenCV image
fr: image OpenCV

source: Color used for debug
fr: Couleur utilisée pour le débogage

source: Masked image
fr: Image masquée

source: Take black & white image and apply morphological transformation
fr: Prend une image en noir et blanc et y applique une transformation morphologique

source: Black & White Image
fr: Image en noir et blanc

source: CLOSE/OPEN/ERODE/DILATE => See on OpenCV/Google if you do not know these words
fr: CLOSE/OPEN/ERODE/DILATE => consultez OpenCV ou Google si vous ne savez pas ce que ces mots signifient.

source: tuple corresponding to the size of the kernel
fr: tuple correspondant à la taille du noyau

source: RECT/ELLIPSE/CROSS => see on OpenCV
fr: RECT/ELLIPSE/CROSS => voir sur OpenCV

source: image after processing
fr: image après traitement

source: Return barycenter of an OpenCV Contour
fr: Retourne le barycentre d'un contour OpenCV

source: Barycenter X, Barycenter Y
fr: Barycentre X, Barycentre Y

source: Return orientation of a contour according to the smallest side in order to be well oriented for gripper
fr: Retourne l'orientation d'un contour en fonction de son plus petit côté afin d'être correctement orienté pour le gripper

source: Angle in radians
fr: Angle en radians

source: Function to find the biggest contour in an binary image
fr: Fonction permettant de trouver le contour le plus grand d'une image binaire

source: Binary Image
fr: Image binaire

source: maximal number of contours which will be returned
fr: Nombre maximal de contours qui peuvent être retournés

source: biggest contours found
fr: Plus grand contour trouvé

source: Draw a list of contour on an image and return the drawing image
fr: Dresse une liste des contours d'une image et retourne le schéma de l'image

source: contours list
fr: List des contours

source: Image with drawing
fr: Image avec schéma

source: Workspaces wise
fr: Workspaces

source: Extract working area from an image thanks to 4 Niryo's markers
fr: Extrait la zone de travail d'une image grâce aux 4 marqueurs Niryo

source: OpenCV image which contain 4 Niryo's markers
fr: Image OpenCV qui contient les 4 marqueurs Niryo

source: Ratio between the width and the height of the area represented by the markers
fr: Ration entre la largeur et la hauteur de la zone représentée par les marqueurs

source: extracted and warped working area image
fr: Image extraite et déformée de la zone de travail

source: Display detected markers on an image
fr: Affiche les marqueurs détectés dans une image

source: OpenCV image which contain Niryo's markers
fr: Image OpenCV qui contient les marqueurs Niryo

source: (status, annotated image)
fr: (statut, image annotée)

source: Transform a pixels position to a relative position
fr: Transforme la position des pixels en une position relative

source: Image where the object is detected
fr: Image où l'objet est détecté

source: coordinate X
fr: Coordonnées X

source: coordinate Y
fr: Coordonnées Y

source: X relative, Y relative
fr: X relatif, Y relativ

source: Show
fr: Affiche

source: Display an image and check whether the user want to close
fr: Affiche une image et vérifie si l'utilisateur veut fermer

source: window's name
fr: nom de la fenêtre

source: boolean indicating if the user wanted to leave
fr: booléen indiquant si l'utilisateur souhaite quitter

source: Display an image during a certain time
fr: Affiche une image pendant une certaine durée

source: Wait time in milliseconds
fr: Temps d'attente en millisecondes

source: value of the key pressed during the display
fr: Valeur de la touche appuyée pendant l'affichage

source: Display an image and wait that the user close it
fr: Affiche une image et attend que l'utilisateur la ferme

source: None
fr: Aucun

source: Image Editing
fr: Retouche d'image

source: Compress OpenCV image
fr: Compresse une image OpenCV

source: OpenCV Image
fr: Image OpenCV

source: integer between 1 - 100. The higher it is, the less information will be lost, but the heavier the compressed image will be
fr: Entier entre 1 et 100. Le plus haut il se situe, le moins d'informations il aura perdu, mais l'image compressée sera plus lourde

source: status & string representing compressed image
fr: statut et chaîne représentant l'image compressée

source: Take a compressed img and return an OpenCV image
fr: Prend une image compressée et retourne une image OpenCV

source: compressed image
fr: Image compressée

source: Add Annotation to an image
fr: Ajoute une annotation à une image

source: text string
fr: Chaîne de texte

source: if you write the text on top
fr: Si vous écrivez le texte sur le dessus

source: img with text written on it
fr: image avec du texte écrit dessus

source: Use camera intrinsics to undistort raw image
fr: Utilise les intrinsèques de l'image pour soigner la distortion d'une image brute

source: Raw Image
fr: Image brute

source: Camera Intrinsics matrix
fr: Matrice des intrinsèques de la camération

source: Distortion Coefficient
fr: Coefficient de distortion

source: Undistorted image
fr: Image non distordue

source: Resize an image. The user should precise only width or height if he wants to keep image's ratio
fr: Redimensionne une image. L'utilisateur doit préciser uniquement la largeur ou la hauteur s'il souhaite conserver le ratio de l'image

source: Target Width
fr: Largeur cible

source: Target Height
fr: Hauteur cible

source: OpenCV interpolation flag
fr: Drapeau d'interpolation OpenCV

source: resized image
fr: Image redimensionnée

source: Concat multiple images along 1 axis
fr: Concatène plusieurs images le long d'un axe

source: tuple of images
fr: Tuple des images

source: 0 means vertically and 1 means horizontally
fr: 0 signifie verticalement, et 1 signifie horizontalement

source: Concat image
fr: Concatène l'image

source: Enums Image Processing
fr: Énumérations de traitement d'images

source: Enums are used to pass specific parameters to functions.
fr: Les énumérations sont utilisées pour passer des paramètres spécifiques aux fonctions.

source: List of enums:
fr: Liste des énumérations

source: An enumeration.
fr: Une énumération.
