Repository: NiryoRobotics/pyniryo
Catalog: docs/locale/*/LC_MESSAGES/source/vision/image_processing_overview.po
Languages: fr

source: Overview & examples
fr: Vue d'ensemble et exemples

source: This file illustrates few image processing pipeline using vision module from niryo_edu package. This module is based in `OpenCV <https://opencv.org/>`_ and its functions are detailed in :doc:`Functions documentation <image_processing_api>`.
fr: Ce document illustre quelques pipelines de traitement d'image utilisation de module de vision du package niryo_edu. Ce module est basé sur `OpenCV <https://opencv.org/>`_ et ses fonctions sont détaillées dans :doc:`Documentation des fonctions <image_processing_api>`.

source: The package niryo_edu comes up with the **vision** module which contains image processing functions including thresholding, blob detection, ...
fr: Le package niryo_edu est fourni avec un module **vision** qui contient des fonctions de traitement d'images incluant du seuillage, la détection de zones d'intérêt (blobs), ...

source: To use it, add to your imports ``from pyniryo.vision import *``.
fr: Afin de l'utiliser, ajoutez à vous importations ``from pyniryo.vision import *``.

source: It is also possible to merge both import lines by using ``from pyniryo import *``.
fr: Il est également possible de fusionner les lignes des deux importations en utilisant ``from pyniryo import *``

source: Play with Robot video stream
fr: Interagir avec le flux vidéo du robot

source: We are firstly going to take a look at robot's functions which can be find at :ref:`API - Vision<source/api_doc/api:Vision>`
fr: Nous allons commencer par étudier les fonctions du robot qui peuvent être trouvées dans :ref:`API - Vision<source/api_doc/api:Vision>`.

source: Get & display image from stream
fr: Obtenir et afficher une image depuis le flux

source: Ned can share its video stream through TCP. As sending raw images will lead to heavy packets which can saturate the network, it sends compressed images. You access it through the robot's function: :meth:`~.api.tcp_client.NiryoRobot.get_img_compressed`. Once your image is received, you firstly need to uncompress via :func:`~.vision.image_functions.uncompress_image` and you can then display it with :func:`~.vision.image_functions.show_img_and_wait_close`. ::
fr: Ned peut partager son flux vidéo par le biais de TCP. Envoyer des images brutes est à l'origine de lourds paquets qui peuvent faire saturer le réseau, alors il envoie des images compressées. Vous pouvez y accéder depuis la fonction du robot suivante : :meth:`~.api.tcp_client.NiryoRobot.get_img_compressed`. Une fois l'image reçue, vous aurez besoin de la décompresser avec :func:`~.vision.image_functions.uncompress_image`. Vous pouvez désormais l'afficher avec la fonction :func:`~.vision.image_functions.show_img_and_wait_close`. ::

source: :func:`~.vision.image_functions.show_img_and_wait_close` will wait for the user to press either *Q* or *Esc* key, before closing the window.
fr: La fonction :func:`~.vision.image_functions.show_img_and_wait_close` attendra que l'utilisateur appuie sur la touche *Q* ou *Esc* avant de fermer la fenêtre.

source: Undistort and display video stream
fr: Rectifier la déformation et afficher le flux vidéo

source: In this section, we are going to display the raw video stream & the undistorted video stream.
fr: Dans cette section, nous afficherons le flux vidéo brut ainsi que le flux vidéo non distordu.

source: As Ned's camera is passing raw images to the robot, these images are distorted due to the camera lens. In order to undistort them, we need to use Ned's camera intrinsics.
fr: Puisque la caméra du Set Vision envoie à Ned des images brutes, ces images sont déformées à cause de la lentille de la caméra. Afin de rectifier leur déformation, nous avons besoin d'utiliser les paramètres intrinsèques de la caméra de Ned.

source: To undistort the raw image, we use :func:`~.vision.image_functions.undistort_image` which need to be called with the parameters given by Ned through :meth:`~.api.tcp_client.NiryoRobot.get_camera_intrinsics`.
fr: Afin de rectifier la déformation de l'image brute, nous utilisons la fonction :func:`~.vision.image_functions.undistort_image` qui doit être appelée avec les paramètres donnés à Ned par :meth:`~.api.tcp_client.NiryoRobot.get_camera_intrinsics`.

source: Once, we have both raw & undistorted images, we can concatenate them in order to display them in once with :func:`~.vision.image_functions.concat_imgs`. Finally, we display the image :func:`~.vision.image_functions.show_img`. ::
fr: Une fois que vous avez l'image brute et l'image non distordue, on peut les concaténer afin de les afficher en une fois avec :func:`~.vision.image_functions.concat_imgs`. Enfin, on affiiche l'image :func:`~.vision.image_functions.show_img`. ::

source: To see more about camera distortion/undistortion, go on `OpenCV Documentation about Camera Calibration <https://docs.opencv.org/2.4/modules/calib3d/doc/camera_calibration_and_3d_reconstruction.html>`_.
fr: Pour en découvrir davantage à propos de la distortion / correction de distortion, rendez vous sur `la documentation OpenCV à propos de la calibration de la caméra <https://docs.opencv.org/2.4/modules/calib3d/doc/camera_calibration_and_3d_reconstruction.html>`_.

source: Pure image processing functions
fr: Fonctions de traitement d'images simple

source: See the curriculum on image processing for more theoretical information.
fr: Consultez notre TP sur le traitement d'images pour des informations plus théoriques.

source: In order to illustrate functions, we are going to use the following image.
fr: Afin d'illuster les fonctions, nous allons utiliser l'image suivante.

source: In this section it is supposed that:
fr: Dans cette section, il est supposé que :

source: You have imported ``pyniryo.vision``
fr: Vous avez importé ``pyniryo.vision``

source: The variable ``img`` is containing the image on which image processing is applied
fr: La variable ``img`` contient l'image sur laquelle le traitement d'images est appliqué

source: Color thresholding
fr: Seuillage de couleurs

source: Color thresholding is very useful in order to detect object with an uniform color. The implemented function to realize this operation is :func:`~.vision.image_functions.threshold_hsv`.
fr: Le seuillage de couleurs est très utile pour détecter un objet avec une couleur uniforme. La fonction implémentée pour réaliser cette opération est :func:`~.vision.image_functions.threshold_hsv`.

source: The following code is using parameters from :class:`~.vision.enums.ColorHSV` enum in order to threshold Red features & *hand made* parameters to extract Blue: ::
fr: Le code suivant utilise les paramètres de l'enum :class:`~.vision.enums.ColorHSV` afin de seuiller les éléments rouges ainsi que des paramètres réalisés à la main pour extraire la couleur bleue. ::

source: Images result
fr: Images obtenues

source: Thresh color
fr: Couleur seuillée

source: Image result
fr: Images obtenues

source: Blue
fr: Bleu

source: Red
fr: Rouge

source: Morphological transformations
fr: Transformations morphologiques

source: Morphological transformations are some simple operations based on the image shape. It is normally performed on binary images. It needs two inputs, one is our original image, second one is called structuring element or kernel which decides the nature of operation. Two basic morphological operators are `Erosion <https://en.wikipedia.org/wiki/Mathematical_morphology#Erosion>`_ and `Dilation <https://en.wikipedia.org/wiki/Mathematical_morphology#Dilation>`_.
fr: Les transformations morphologiques sont des opérations simples basées sur la forme de l'image. Elles sont normalement réalisée sur des images binaires. Elles nécessitent deux entrées, l'une est notre image originale, l'autre est appelée élément structurant ou noyau et décide de la nature de l'opération. Les deux opérateurs morphologiques communs sont `l'érosion <https://en.wikipedia.org/wiki/Mathematical_morphology#Erosion>`_ et la `dilatation <https://en.wikipedia.org/wiki/Mathematical_morphology#Dilation>`_.

source: Then its variant forms like `Opening <https://en.wikipedia.org/wiki/Mathematical_morphology#Opening>`_, `Closing <https://en.wikipedia.org/wiki/Mathematical_morphology#Closing>`_ also comes into play. Learn more on `Wikipedia page <https://en.wikipedia.org/wiki/Mathematical_morphology>`_.
fr: Ensuite ses variantes comme `l'ouverture <https://en.wikipedia.org/wiki/Mathematical_morphology#Opening>`_, la `fermeture <https://en.wikipedia.org/wiki/Mathematical_morphology#Closing>`_ sont sont également à prendre en compte. Apprenez-en plus sur la `page Wikipédia <https://fr.wikipedia.org/wiki/Morphologie_mathématique>`_.

source: The implemented function to realize these operations is :func:`~.vision.image_functions.morphological_transformations`. It uses :class:`~.vision.enums.MorphoType` and :class:`~.vision.enums.KernelType` to determine which operation should be applied on the image.
fr: Afin de réaliser ses opérations, la fonction implémentée est :func:`~.vision.image_functions.morphological_transformations`. Elle utilise :class:`~.vision.enums.MorphoType` et :class:`~.vision.enums.KernelType` afin de déterminer quelle opération doit être appliquée à l'image.

source: The code shows how to do a Closing & an Erosion: ::
fr: Le code montre comment réaliser une fermeture et une érosion : ::

source: None
fr: Aucun

source: Erode
fr: Érodé

source: Image Erode
fr: Images obtenues

source: Close
fr: Fermé

source: Contours finder
fr: Détection de contours

source: Contours can be explained simply as a curve joining all the continuous points (along the boundary), having same color or intensity. The contours are a useful tool for shape analysis and object detection and recognition. See more on `OpenCV Documentation <https://docs.opencv.org/3.4/d3/d05/tutorial_py_table_of_contents_contours.html>`_.
fr: Les contours peuvent être expliqués par une courbe reliant tous les points ayant la même couleur ou intensité. La détection de contours est un outil utile pour l'analyse de formes et la détection et reconnaissance d'objets. Apprenez en plus sur la `Documentation OpenCV <https://docs.opencv.org/3.4/d3/d05/tutorial_py_table_of_contents_contours.html>`_.

source: The implemented function to realize these operations is :func:`~.vision.image_functions.biggest_contours_finder` which takes a Black & White image, and extract the biggest (in term of area) contours from it.
fr: Afin de réaliser ces opérations, la fonction implémentée est :func:`~.vision.image_functions.biggest_contours_finder` qui prend une image en noir et blanc et en extrait le plus grand (en terme de surface) contour.

source: The code to extract and draw the 3 biggest contours from an image is the following: ::
fr: Le code permettant d'extraire et dessiner les 3 plus grands contours d'une image sont les suivants : ::

source: Thresh + Opening
fr: Seuil + ouverture

source: Find object center position
fr: Trouve le centre l'objet

source: In order to catch an object, we need to find a pose from where the end effector can grasp the object. The following method uses contours which have been found in the previous section and finds their barycenter and orientation via the functions :func:`~.vision.image_functions.get_contour_barycenter` & :func:`~.vision.image_functions.get_contour_angle`. ::
fr: Afin d'attraper un objet, nous avons besoin de trouver une position depuis laquelle l'effecteur peut saisir l'objet. La méthode qui suit utilise les contours qui ont été trouvés dans la section précedente et trouve ainsi leur barycentre et leur orientation via les fonctions :func:`~.vision.image_functions.get_contour_barycenter` & :func:`~.vision.image_functions.get_contour_angle`. ::

source: Barycenter + Angle
fr: Barycentre + Angle

source: The drawn vector is normal to the contour's length because we want Ned to catch the object by the width rather than the length. Indeed, it leads to least cases where the gripper cannot open enough.
fr: Le vecteur dessiné est normal à la longueur du contour, car nous voulons que Ned attrape l'objet dans sa largeur plutôt que dans sa longueur. En effet, cela permet de réduire le nombre de cas dans lequel le gripper ne peut pas s'ouvrir de manière suffisante.

source: Markers extraction
fr: Extraction des marqueurs

source: As image processing happens in a workspace, it is important to extract the workspace beforehand! To do so, you can use the function :func:`~.vision.image_functions.extract_img_workspace`. ::
fr: Puisque le traitement d'images à lieu dans un espace de travail, il est important d'extraire cet espace de travail avant tout ! Pour cela, vous pouvez utiliser la fonction :func:`~.vision.image_functions.extract_img_workspace`. ::

source: Extracted
fr: Extraite

source: Extracted Image
fr: Extraite

source: Debug mode
fr: Mode debogage

source: If Ned's functions are failing, you can use Debug functions which are :func:`~.vision.image_functions.debug_threshold_color` & :func:`~.vision.image_functions.debug_markers` in order to display what the robot sees.
fr: Si les fonctions de Ned échouent, vous pouvez utiliser les fonctions de debogage qui sont :func:`~.vision.image_functions.debug_threshold_color` & :func:`~.vision.image_functions.debug_markers`, afin d'afficher sur l'écran ce que le robot voit.

source: You can use the functions as follow: ::
fr: Vous pouvez utiliser les fonctions qui suivent : ::

source: Debug red
fr: Debogage rouge

source: Debug Red Image
fr: Debogage rouge

source: Debug Markers
fr: Debogage marqueurs

source: Debug Markers Image
fr: Debogage marqueurs

source: Do your own image processing!
fr: Créer votre propre traitement d'images !

source: Now that you are a master in image processing, let's look at full examples.
fr: Maintenant que vous êtes un professionnel en traitement d'images, regardons des exemples complets.

source: Display video stream with extracted workspace
fr: Affiche le flux vidéo avec le workspace extrait

source: In the current state, the following code will display the video stream and the extracted workspace image. You can add your own image processing functions maybe to apply additional process. ::
fr: Dans l'état actuel, le code suivant affichera le flux vidéo et extraira l'image de l'espace de travail. Vous pouvez ajouter vos propres fonctions de traitement d'images afin d'appliquer des process additionnels. ::

source: Vision pick via your image processing pipeline
fr: Saisie par la vision avec votre pipeline de traitement d'images.

source: You may want to send coordinate to Ned in order to pick the object of your choice! To do that, use the function :func:`~.vision.image_functions.get_target_pose_from_rel` which converts a relative pose in the workspace into a pose in the robot's world! ::
fr: Si vous souhaitez envoyer des coordonnées à Ned afin qu'il saisisse l'objet de votre choix, utilisez la fonction :func:`~.vision.image_functions.get_target_pose_from_rel`, qui convertit une position relative sur le workspace en une position dans l'environnement du robot ! ::
