Repository: NiryoRobotics/pyniryo
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: fr

source: Setup
fr: Installation

source: Examples
fr: Exemples

source: API Documentation
fr: Documentation API

source: Image Processing
fr: Traitement d'images

source: PyNiryo Documentation
fr: Documentation PyNiryo

source: This documentation presents Ned's PyPi package, which is a TCP API made with Python.
fr: Cette documentation présente le package PyPi de Ned, qui est une API TCP créée avec Python.

source: It offers a simple way for developers to create programs for robot and to control them via remote communication from their computers. Contrary to the Python ROS Wrapper, the user will not need to be connected on the robot through a terminal.
fr: Cette API permet aux développeurs de créer des programmes robotiques facilement et de contrôler les robots en communiquant à distance par le biais de leurs ordinateurs. Contrairement au Wrapper ROS Python, l'utilisateur ne nécessitera pas d'être connecté au robot par le biais d'un terminal.

source: This package is able to control Ned in simulation as well as the physical robot.
fr: Ce package est capable de contrôler Ned physiquement mais également en simulation.

source: Version compatibility
fr: Compatibilité des versions

source: Version compatibility table
fr: Table de compatibilité des versions

source: PyNiryo version
fr: Version PyNiryo

source: ROS Stack version
fr: Version de la stack ROS

source: Before getting started
fr: Avant de commencer

source: If you haven’t already done so, make sure to learn about the ROS robot software by reading `ROS documentation <https://docs.niryo.com/dev/ros/index.html>`_.
fr: Si ce n'est pas déjà le cas, familiarisez vous avec le logiciel ROS du robot en lisant `la documentation ROS <https://docs.niryo.com/dev/ros/index.html?lang=fr>`_.

source: This documentation also contains everything you need to know if you want to use Ned through simulation.
fr: Cette documentation contient également tout ce que vous devez savoir si vous souhaitez utiliser Ned en simulation.

source: Sections organization
fr: Organisation des sections

source: This document is organized in 4 main sections.
fr: Ce document est organisé en quatre sections principales.

source: Install & Setup your environment in order to use Ned with PyNiryo.
fr: Installez et mettez en place votre environnement afin d'utiliser Ned avec PyNiryo.

source: Firstly, follow :doc:`Installation instructions <source/setup/installation>`, then :doc:`find your Robot IP address <source/setup/ip_address>` to be ready.
fr: Commencez par suivre les :doc:`instructions d'installation <source/setup/installation>`, puis :doc:`trouvez l'adresse IP de votre robot <source/setup/ip_address>` afin d'être complètement prêt.

source: Learn how to use the PyNiryo package to implement various tasks.
fr: Apprenez comment utiliser le package PyNiryo afin d'implémenter diverses tâches.

source: Master controls with PyNiryo with full the detailed functions :doc:`here <source/api_doc/api>`.
fr: Le master est contrôlé par PyNiryo via les fonctions détaillées :doc:`ici <source/api_doc/api>`.

source: Discover also :doc:`Vision Functions <source/vision/image_processing_overview>` to create your own image processing pipelines!
fr: Découvrez également les :doc:`Fonctions de vision <source/vision/image_processing_overview>` afin de créer vos propres pipelines de traitement d'images !

source: Start with Image Processing
fr: Débuter avec le traitement d'images

source: Discover how to create your own image processing pipelines!
fr: Découvrez comment créer vos propres pipelines de traitement d'images !

source: Indices and tables
fr: Indexes et tableaux
