Repository: NiryoRobotics/pyniryo
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/api.po
Languages: fr

source: PyNiryo API Documentation
fr: Documentation de l'API PyNiryo

source: This file presents the different :ref:`source/api_doc/api:Command Functions`, :ref:`source/api_doc/api:Enums` & :ref:`source/api_doc/api:Python Object classes` available with the API.
fr: Ce document présente les différentes :ref:`source/api_doc/api:Command Functions`, :ref:`source/api_doc/api:Enums` & les :ref:`source/api_doc/api:Python object classes` disponibles avec l'API

source: :ref:`source/api_doc/api:Command Functions` are used to deal directly with the robot. It could be :meth:`~.api.tcp_client.NiryoRobot.move_joints`, :meth:`~.api.tcp_client.NiryoRobot.get_hardware_status` :meth:`~.api.tcp_client.NiryoRobot.vision_pick`, or also :meth:`~.api.tcp_client.NiryoRobot.run_conveyor`
fr: Les :ref:`source/api_doc/api:Command Functions` sont utilisées pour intéragir directement avec le robot. Elles peuvent être :meth:`~.api.tcp_client.NiryoRobot.move_joints`, :meth:`~.api.tcp_client.NiryoRobot.get_hardware_status` :meth:`~.api.tcp_client.NiryoRobot.vision_pick`, ou encore :meth:`~.api.tcp_client.NiryoRobot.run_conveyor`

source: :ref:`source/api_doc/api:Enums` are used to pass specific arguments to functions. For instance :class:`~.api.enums_communication.PinState`, :class:`~.api.enums_communication.ConveyorDirection`, ...
fr: :ref:`source/api_doc/api:Enums` sont utilisées pour passer des arguments spécifiques aux fonctions. Par exemple :class:`~.api.enums_communication.PinState`, :class:`~.api.enums_communication.ConveyorDirection`, ...

source: :ref:`source/api_doc/api:Python Object classes`, as |pose_object|, ease some operations
fr: Les :ref:`objets Python <source/api_doc/api:Python Object classes>`, tels que |pose_object|, facilitent certaines opérations.

source: Command functions
fr: Fonctions de commande

source: This section references all existing functions to control your robot, which includes:
fr: Cette section référence toutes les fonctions existantes permettant de contrôler votre robot, incluant :

source: Moving the robot
fr: Bouger le robot

source: Using Vision
fr: Utiliser la Vision

source: Controlling Conveyor Belts
fr: Contrôler le convoyeur

source: Playing with Hardware
fr: Utiliser le hardware

source: All functions to control the robot are accessible via an instance of the class :class:`~.api.enums_communication.NiryoRobot` ::
fr: Toutes les fonctions permettant de contrôler le robot sont disponibles depuis une instance de la classe :class:`~.api.enums_communication.NiryoRobot` : ::

source: See examples on :ref:`source/examples/examples_basics:Examples: Basics`
fr: Voir un exemple dans la :ref:`section Exemples<source/examples/examples_basics:Examples: Basics>`

source: List of functions subsections:
fr: Liste des sous-sections des fonctions :

source: TCP Connection
fr: Connexion TCP

source: Connect to the TCP Server
fr: Se connecter au serveur TCP

source: Parameters
fr: Paramètres

source: IP Address
fr: Adresse IP

source: Return type
fr: Type de la variable de retour

source: Close connection with robot
fr: Couper la connexion avec le robot

source: Main purpose functions
fr: Fonctions principales

source: Calibrate (manually or automatically) motors. Automatic calibration will do nothing if motors are already calibrated
fr: Calibrer (manuellement ou automatiquement) les moteurs. La calibration automatique ne provoquera rien si les moteurs sont déjà calibrés

source: Auto or Manual
fr: Auto ou Manuel

source: Start a automatic motors calibration if motors are not calibrated yet
fr: Démarre une calibration automatique des moteurs si les moteurs n'ont pas encore été calibrés

source: Return a bool indicating whereas the robot motors need to be calibrate
fr: Renvoie un booléen indiquant si les moteurs du robot ont besoin d'être calibrés

source: Get learning mode state
fr: Afficher l'état du mode apprentissage

source: Returns
fr: Retourne

source: ``True`` if learning mode is on
fr: ``Vrai`` si le mode apprentissage est activé

source: Set learning mode if param is ``True``, else turn it off
fr: Allumer le mode apprentissage si param est ``Vrai``, sinon l'arrêter

source: ``True`` or ``False``
fr: ``Vrai`` ou ``Faux``

source: Limit arm max velocity to a percentage of its maximum velocity
fr: Limiter la vitesse maximum du bras à un pourcentage de sa vitesse maximum

source: Should be between 1 & 100
fr: Peut être entre 1 & 100

source: Set jog control mode if param is True, else turn it off
fr: Allumer le mode de contrôle par translation si param est ``Vrai``, sinon l'arrêter

source: Wait for a certain time
fr: Attendre pendant un certain temps

source: duration in seconds
fr: durée en secondes

source: Joints & Pose
fr: Axe & Pose

source: Get joints value in radians You can also use a getter ::
fr: Obtenir la valeur des axes en radians. Vous pouvez également utiliser un getter ::

source: List of joints value
fr: Liste de la valeur des joints

source: Get end effector link pose as [x, y, z, roll, pitch, yaw]. x, y & z are expressed in meters / roll, pitch & yaw are expressed in radians You can also use a getter ::
fr: Obtenir la position de l'effecteur en [w, y, z, roll, pitch, yaw]. x, y & z sont exprimés en mètres / roll, pitch & yaw sont exprimés en radians. Il est également possible d'utiliser un getter ::

source: Get end effector link pose in Quaternion coordinates
fr: Obtenir la position de l'effecteur en coordonnées Quaternion

source: Move robot joints. Joints are expressed in radians.
fr: Bouger les axes du robots. Les axes sont exprimés en radians.

source: All lines of the next example realize the same operation: ::
fr: L'ensemble des lignes du prochain exemple réalisent la même opération : ::

source: either 6 args (1 for each joints) or a list of 6 joints
fr: soit 6 args (1 pour chaque axe) ou une liste de 6 axes

source: Move robot end effector pose to a (x, y, z, roll, pitch, yaw) pose. x, y & z are expressed in meters / roll, pitch & yaw are expressed in radians
fr: Modifier la position de l'effecteur du robot à une position (x, y, z, roll, pitch, yaw). x, y & z sont exprimés en mètres, roll, pitch et yaw sont exprimés en radians

source: either 6 args (1 for each coordinates) or a list of 6 coordinates or a ``PoseObject``
fr: soit 6 args (1 pour chaque coordonnées) ou une liste de 6 coordonnées, ou un ``PoseObject``

source: Move robot end effector pose to a (x, y, z, roll, pitch, yaw) pose with a linear trajectory
fr: Modifier la position de l'effecteur du robot à une position (x, y, z,roll, pitch, yaw) avec une trajectoire linéaire

source: either 6 args (1 for each coordinates) or a list of 6 coordinates or a PoseObject
fr: soit 6 args (1 pour chaque coordonnées) ou une liste de 6 coordonnées, ou un PoseObject

source: Shift robot end effector pose along one axis
fr: Glisser la position de l'effecteur du robot le long d'un axe

source: Axis along which the robot is shifted
fr: Axe le long duquel l'effecteur du robot est déplacé

source: In meter for X/Y/Z and radians for roll/pitch/yaw
fr: En mètres pour X/Y/Z et en radians pour roll/pitch/yaw

source: Shift robot end effector pose along one axis, with a linear trajectory
fr: Glisser la position de l'effecteur du robot le long d'un axe, avec une trajectoire linéaire

source: Jog robot joints'. Jog corresponds to a shift without motion planning. Values are expressed in radians.
fr: Translation des axes du robot. La translation correspond à un glissement sans plannification de mouvement. Les valeurs sont exprimées en radians.

source: either 6 args (1 for each joints) or a list of 6 joints offset
fr: soit 6 args (1 pour chaque axe) ou une liste des offsets des 6 axes

source: Jog robot end effector pose Jog corresponds to a shift without motion planning Arguments are [dx, dy, dz, d_roll, d_pitch, d_yaw] dx, dy & dz are expressed in meters / d_roll, d_pitch & d_yaw are expressed in radians
fr: Les arguments sont [dx, dy, dz, d_roll, d_pitch, d_yaw] dx, dy & dz sont exprimés en mètres / d_roll, d_pitch & d_yaw sont exprimés en radians

source: either 6 args (1 for each coordinates) or a list of 6 offset
fr: soit 6 args (1 pour chaque axe) ou une liste de 6 offset

source: Move to a position where the forearm lays on shoulder
fr: Bouger le robot à une position dans laquelle l'avant bras du robot repose sur son épaule

source: Go to home pose and activate learning mode
fr: Retourner à la position de départ et activer le mode apprentissage

source: Compute forward kinematics of a given joints configuration and give the associated spatial pose
fr: Calculer la cinématique directe d'une configuration des axes donnée et donner la position dans l'espace qui y est associée

source: Compute inverse kinematics
fr: Calculer la cinématique inverse

source: Saved Poses
fr: Positions sauvegardées

source: Get pose saved in from Ned's memory
fr: Utiliser une position sauvegardée depuis la mémoire de Ned

source: Pose name in robot's memory
fr: Nom de la position dans la mémoire du robot

source: Pose associated to pose_name
fr: Position associée au pose_name

source: Save pose in robot's memory
fr: Sauvegarder une position dans la mémoire du robot

source: Delete pose from robot's memory
fr: Supprimer une position dans la mémoire du robot

source: Get list of poses' name saved in robot memory
fr: Afficher la liste de noms des positions sauvegardées dans la mémoire du robot

source: Execute a picking from a pose.
fr: Exécuter un prélèvement depuis une position

source: A picking is described as :
fr: Un prélèvement est décrit comme :

source: * going over the object
fr: \* descendre en direction de l'objet

source: * going down until height = z
fr: \* descendre jusque hauteur = z

source: * grasping with tool
fr: \* attraper avec un outil

source: * going back over the object
fr: \* retourner au dessus de l'objet

source: Execute a placing from a position.
fr: Exécuter un placement depuis une position

source: A placing is described as :
fr: Un placement est décrit comme :

source: * going over the place
fr: \* aller en direction d'un emplacement

source: * releasing the object with tool
fr: \* relâcher l'objet avec un outil

source: * going back over the place
fr: \* retourner au dessus de l'emplacement

source: Execute a pick then a place
fr: Exécuter un prélèvement puis un placement

source: Pick Pose : [x, y, z, roll, pitch, yaw] or PoseObject
fr: Position de prélèvement : [x, y, z, roll, pitch, yaw] ou PoseObject

source: Place Pose : [x, y, z, roll, pitch, yaw] or PoseObject
fr: Position de placement : [x, y, z, roll, pitch, yaw] ou PoseObject

source: Distance from waypoints before smoothing trajectory
fr: Distance entre les points de passage avant le lissage de la trajectoire

source: Trajectories
fr: Trajectoires

source: Get trajectory saved in Ned's memory
fr: Obtenir la trajectoire sauvegardée dans la mémoire de Ned

source: Trajectory
fr: Trajectoires

source: Execute trajectory from list of poses
fr: Exécuter une trajectoire depuis une liste de positions

source: List of [x,y,z,qx,qy,qz,qw] or list of [x,y,z,roll,pitch,yaw] or a list of [j1,j2,j3,j4,j5,j6]
fr: Liste contenant [x,y,z,qx,qy,qz,qw] ou [x,y,z,roll,pitch,yaw]

source: List of string 'pose' or 'joint', or ['pose'] (if poses only) or ['joint'] (if joints only). If None, it is assumed there are only poses in the list.
fr: Liste de string contenant 'pose' ou 'joint', ou ['pose'] (si uniquement des 'pose') ou ['joint'] (si uniquement des 'joint'). Si l'argument est None, le type est mis à ['Pose'] par défaut.

source: Execute trajectory from Ned's memory
fr: Exécuter la trajectoire depuis la mémoire de Ned

source: Save trajectory in robot memory
fr: Sauvegarder la trajectoire dans la mémoire du robot

source: Delete trajectory from robot's memory
fr: Supprimer la trajectoire de la mémoire du robot.

source: Get list of trajectories' name saved in robot memory
fr: Obtenir la liste des noms des trajectoires sauvegardées dans la mémoire du robot

source: Tools
fr: Outils

source: Get equipped tool Id
fr: Obtenir l'ID de l'outil installé

source: Update equipped tool
fr: Mettre à jour l'outil installé

source: Grasp with tool | This action correspond to | - Close gripper for Grippers | - Pull Air for Vacuum pump | - Activate for Electromagnet
fr: Saisir avec l'outil | Cette action correspond à | - Close gripper pour les grippers | - Pull Air pour la pompe à vide | - Activate pour l'électroaimant

source: Release with tool | This action correspond to | - Open gripper for Grippers | - Push Air for Vacuum pump | - Deactivate for Electromagnet
fr: Relâcher avec l'outil | Cette action correspond à | - Open gripper pour les grippers | - Push Air pour la pompe à vide | - Deactivate pour l'électroaimant

source: Open gripper associated to 'gripper_id' with a speed 'speed'
fr: Ouvrir le gripper associé à 'gripper_id' avec une vitesse correspondant à 'speed'

source: Between 100 & 1000
fr: Entre 100 & 1000

source: Close gripper associated to 'gripper_id' with a speed 'speed'
fr: Fermer le gripper associé à 'gripper_id'avec une vitesse correspondant à 'speed'

source: Pull air of vacuum pump
fr: Aspirer l'air de la pompe à vide

source: Push air of vacuum pump
fr: Souffler l'air de la pompe à vide

source: Setup electromagnet on pin
fr: Installer l'électroaimant sur une broche

source: Activate electromagnet associated to electromagnet_id on pin_id
fr: Activer l'électroaimant associé à electromagnet_id sur pin_id

source: Deactivate electromagnet associated to electromagnet_id on pin_id
fr: Désactiver l'électroaimant associé à electromagnet_id sur pin_id

source: Enables or disables the TCP function (Tool Center Point). If activation is requested, the last recorded TCP value will be applied. The default value depends on the gripper equipped. If deactivation is requested, the TCP will be coincident with the tool_link.
fr: Active ou désactive la fonction PCO (Point Central de l'Outil). Si une activation est demandée, la dernière valeur pour le PCO va être appliquée. Par défaut la valeur dépend de la pince équipée. Si la désactivation est demandée, le PCO va coincider avec le repère 'tool_link'.

source: True to enable, False otherwise.
fr: True pour activer, False pour désactiver.

source: Activates the TCP function (Tool Center Point) and defines the transformation between the tool_link frame and the TCP frame.
fr: Active la fonction de PCO (Point Central de l'Outil) et définit la transformation entre le repère 'tool_link' et le repère du PCO.

source: Reset the TCP (Tool Center Point) transformation. The TCP will be reset according to the tool equipped.
fr: Réinitialise la transformation appliquée au PCO (Point Central de l'Outil). La valeur par défaut dépend de l'outil actuellement équipé.

source: Reboot the motor of the tool equipped. Useful when an Overload error occurs. (cf HardwareStatus)
fr: Redémarre le moteur de l'outil actuellement équipé. Peut être utile quand une erreur 'Overload' apparaît. (cf HardwareStatus)

source: Hardware
fr: Matériel

source: Set pin number pin_id to mode pin_mode
fr: Régler le numéro de broche pin_id sur le mode pin_mode

source: Set pin_id state to digital_state
fr: Régler l'état de pin_id sur digital_state

source: Read pin number pin_id and return its state
fr: Lire le numéro de broche pin_id et retourne à son état

source: Get hardware status : Temperature, Hardware version, motors names & types ...
fr: Obtenir le statut hardware : température, version hardware, noms et types des moteurs ...

source: Infos contains in a HardwareStatusObject
fr: Informations contenues dans un HardwareStatusObject

source: Get Digital IO state : Names, modes, states
fr: Obtenir l'état des IO digitaux : noms, modes, états

source: List of DigitalPinObject instance
fr: Liste des instances DigitalPinObject

source: Conveyor
fr: Convoyeur

source: Activate a new conveyor and return its ID
fr: Activer un nouveau convoyeur et renvoyer son ID

source: New conveyor ID
fr: Nouvel ID du convoyeur

source: Remove specific conveyor.
fr: Retirer un convoyeur spécifique

source: Basically, ConveyorID.ONE or ConveyorID.TWO
fr: Généralement, ConveyorID.ONE ou ConveyorID.TWO

source: Run conveyor at id 'conveyor_id'
fr: Activer le convoyeur avec l'id 'conveyor_id'

source: Stop conveyor at id 'conveyor_id'
fr: Arrêter le convoyeur avec l'id 'conveyor_id'

source: Control conveyor at id 'conveyor_id'
fr: Contrôler le convoyeur avec l'id 'conveyor_id'

source: New speed which is a percentage of maximum speed
fr: Nouvelle vitesse qui est un pourcentage de la vitesse maximum

source: Conveyor direction
fr: Direction du convoyeur

source: List of the connected conveyors' ID
fr: Liste des ID des convoyeurs connectés

source: Get image from video stream in a compressed format. Use ``uncompress_image`` from the vision package to uncompress it
fr: Obtenir l'image du flux vidéo dans un format compressé. Utiliser ``uncompress_image`` du package vision pour les décompresser

source: string containing a JPEG compressed image
fr: Chaîne contenant une image JPEG compressée

source: Modify video stream brightness
fr: Modifie la luminosité du stream vidéo

source: How much to adjust the brightness. 0.5 will give a darkened image, 1 will give the original image while 2 will enhance the brightness by a factor of 2.
fr: Comment ajuster la luminosité: 0.5 donnera une image assombrie, 1 l'image d'origine et 2 augmentera la luminosité par un facteur de 2.

source: Modify video stream contrast
fr: Modifie le contraste du stream vidéo

source: While a factor of 1 gives original image. Making the factor towards 0 makes the image greyer, while factor>1 increases the contrast of the image.
fr: Un facteur de 1 équivaut à l'image d'origine. Plus le multiplicateur se rapproche de 0 et plus l'image deviendra grise, "tandis qu'un facteur > 1 augmentera le contraste de l'image.

source: Modify video stream saturation
fr: Modifie la saturation du stream vidéo

source: How much to adjust the saturation. 0 will give a black and white image, 1 will give the original image while 2 will enhance the saturation by a factor of 2.
fr: Comment ajuster la saturation: 0 donnera une image en noir et blanc, 1 équivaut à l'image d'origine, tandis que 2 va augmenter la saturation par un facteur de 2.

source: Get last stream image parameters: Brightness factor, Contrast factor, Saturation factor.
fr: Retourne les paramètres de la dernière image publiées: facteurs de luminosité, contraste et saturation.

source: Brightness factor: How much to adjust the brightness. 0.5 will give a darkened image, 1 will give the original image while 2 will enhance the brightness by a factor of 2.
fr: Comment ajuster le facteur de luminosité: 0.5 donnera une image assombrie, 1 l'image d'origine et 2 augmentera la luminosité par un facteur de 2.

source: Contrast factor: A factor of 1 gives original image. Making the factor towards 0 makes the image greyer, while factor>1 increases the contrast of the image.
fr: Comment ajuster le facteur de contraste: 1 équivaut à l'image d'origine. Plus le multiplicateur se rapproche de 0 et plus l'image deviendra grise, "tandis qu'un facteur > 1 augmentera le contraste de l'image.

source: Saturation factor: 0 will give a black and white image, 1 will give the original image while 2 will enhance the saturation by a factor of 2.
fr: Comment ajuster le facteur de saturation: 0 donnera une image en noir et blanc, 1 équivaut à l'image d'origine, tandis que 2 va augmenter la saturation par un facteur de 2.

source: Brightness factor, Contrast factor, Saturation factor
fr: Facteur de luminosité, contraste et saturation

source: Given a pose (x_rel, y_rel, yaw_rel) relative to a workspace, this function returns the robot pose in which the current tool will be able to pick an object at this pose.
fr: Pour une pose (x_rel, y_rel, yaw_rel) donnée relative à un workspace, cette fonction retourne la position du robot dans laquelle l'outil actuel sera capable d'attraper un objet.

source: The height_offset argument (in m) defines how high the tool will hover over the workspace. If height_offset = 0, the tool will nearly touch the workspace.
fr: L'argument height_offset (en mètres) définit à quelle hauteur l'outil va passer au dessus du workspace. Si height_offset = 0, alors l'outil touchera presque l'espace de travail.

source: name of the workspace
fr: Nom du workspace

source: offset between the workspace and the target height
fr: Offset entre le workspace sa hauteur cible

source: x relative pose (between 0 and 1)
fr: pose relative de x (entre 0 et 1)

source: y relative pose (between 0 and 1)
fr: pose relative de y (entre 0 et 1)

source: Angle in radians
fr: Angle en radians

source: First detects the specified object using the camera and then returns the robot pose in which the object can be picked with the current tool
fr: Commence par détecter l'objet spécifié en utilisant la caméra puis renvoie la position du robot à laquelle l'objet peut être attrapé avec l'outil utilisé.

source: shape of the target
fr: Forme de la cible

source: color of the target
fr: Couleur de la cible

source: Picks the specified object from the workspace. This function has multiple phases:
fr: Attrape l'objet spécifié sur le workspace. Cette fonction est composée de plusieurs phases :

source: 1. detect object using the camera
fr: \1. détecte l'objet en utilisant la caméra

source: 2. prepare the current tool for picking
fr: \2. prépare l'outil utilisé pour la saisie

source: 3. approach the object
fr: \3. approche l'objet

source: 4. move down to the correct picking pose
fr: \4. descend jusque la bonne position de saisie

source: 5. actuate the current tool
fr: \5. actionne l'outil utilisé

source: 6. lift the object
fr: \6. soulève l'objet

source: Example::
fr: Exemple ::

source: Same as `get_target_pose_from_cam` but directly moves to this position
fr: Même fonction que `get_target_pose_from_cam` mais bouge directement à cette position

source: Detect object in workspace and return its pose and characteristics
fr: Détecter l'objet sur le workspace et renvoyer sa position et ses caractéristiques

source: Get calibration object: camera intrinsics, distortions coefficients
fr: Obtenir la calibration de l'objet : paramètres instrinsèques de la caméra, taux de distorsion

source: camera intrinsics, distortions coefficients
fr: paramètres instrinsèque de la caméra, taux de distorsion

source: Save workspace by giving the poses of the robot to point its 4 corners with the calibration Tip. Corners should be in the good order. Markers' pose will be deduced from these poses
fr: Sauvegarder le workspace en donnant au robot les 4 positions lui permettant de pointer ses 4 coins avec la pointe de calibration. Les coins doivent être dans le bon ordre. La position de ces marqueurs sera déduite de ces positions.

source: Poses should be either a list [x, y, z, roll, pitch, yaw] or a PoseObject
fr: Les positions peuvent également être une liste [x, y, z, roll, pitch, yaw] ou un PoseObject.

source: workspace name, maximum lenght 30 char.
fr: nom du workspace, maximum 30 caractères

source: Save workspace by giving the points of worskpace's 4 corners. Points are written as [x, y, z] Corners should be in the good order.
fr: Sauvegarder le workspace en donnant les points des 4 coins du workspaces. Ces points sont écrits [x, y, z]. Les coins doivent être dans le bon ordre.

source: Delete workspace from robot's memory
fr: Supprimer le workspace de la mémoire du robot

source: Get workspace ratio from robot's memory
fr: Obtenir le ratio du workspace depuis la mémoire du robot

source: Get list of workspaces' name store in robot's memory
fr: Obtenir la liste des noms des workspaces stockés dans la mémoire du robot

source: Enums
fr: Enums (énumérations)
