Repository: NiryoRobotics/pyniryo
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/api.po
Languages: fr

source: Enums are used to pass specific parameters to functions.
fr: Les énumérations sont utilisées pour passer des paramètres spécifiques aux fonctions.

source: For instance, :meth:`~.api.tcp_client.NiryoRobot.shift_pose` will need a parameter from :class:`~.api.objects.RobotAxis` enum ::
fr: Par exemple, :meth:`~.api.tcp_client.NiryoRobot.shift_pose` aura besoin d'un paramètre de type l'enum :class:`~.api.objects.RobotAxis` ::

source: List of enums:
fr: Liste des énumérations

source: Enumeration of Calibration Modes
fr: Énumération des modes de calibration

source: Enumeration of Robot Axis : it used for Shift command
fr: Énumération des axes du robot : utilisé pour la commande shift

source: Enumeration of Tools IDs
fr: Énumération des ID des outils

source: Enumeration of Pin Modes
fr: Énumération des modes des broches

source: Pin State is either LOW or HIGH
fr: L'état des broches est soit LOW ou HIGH

source: Enumeration of Robot Pins
fr: Énumération des broches du robot

source: Enumeration of Conveyor IDs used for Conveyor control
fr: Énumération des ID du convoyeur utilisés pour le contrôle du convoyeur

source: Enumeration of Conveyor Directions used for Conveyor control
fr: Énumération des directions du convoyeur utilisés pour le contrôle du convoyeur

source: Enumeration of Colors available for image processing
fr: Énumération des couleurs disponibles pour le traitement d'images

source: Enumeration of Shapes available for image processing
fr: Énumération des formes disponibles pour le traitement d'images

source: Python object classes
fr: Classes d'objets Python

source: Special objects
fr: Objets spéciaux

source: Pose object which stores x, y, z, roll, pitch & yaw parameters
fr: Pose object qui stocke les paramètres x, y, z, roll, pitch & yaw

source: Create a new pose from copying from copying actual pose with offsets
fr: Créer une nouvelle position en copiant a position actuelle avec des offsets

source: Return a list [x, y, z, roll, pitch, yaw] corresponding to the pose's parameters
fr: Retourne une liste [x, y, z, roll, pitch, yaw] correspondant aux paramètres de la position.

source: Object used to store every hardware information
fr: Objet utilisé pour stocker toutes les informations matérielles

source: Object used to store information on digital pins
fr: Objet utilisé pour stocker toutes les informations relatives aux digital pins
